xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_comp.c
    /* Set HAL COMP handle state */
    switch(hcomp->State)
    {
    case HAL_COMP_STATE_RESET:
      hcomp->State = HAL_COMP_STATE_RESET_LOCKED;
      break;
    case HAL_COMP_STATE_READY:
      hcomp->State = HAL_COMP_STATE_READY_LOCKED;
      break;
    default: /* HAL_COMP_STATE_BUSY */
      hcomp->State = HAL_COMP_STATE_BUSY_LOCKED;
      break;
    }
  }

  if(status == HAL_OK)
  {
    /* Set the lock bit corresponding to selected comparator */
    __HAL_COMP_LOCK(hcomp);
  }

  return status;
}

/**
  * @brief  Return the output level (high or low) of the selected comparator.
  *         The output level depends on the selected polarity.
  *         If the polarity is not inverted:
  *           - Comparator output is low when the input plus is at a lower
  *             voltage than the input minus
  *           - Comparator output is high when the input plus is at a higher
  *             voltage than the input minus
  *         If the polarity is inverted:
  *           - Comparator output is high when the input plus is at a lower
  *             voltage than the input minus
  *           - Comparator output is low when the input plus is at a higher
  *             voltage than the input minus
  * @param  hcomp  COMP handle
  * @retval Returns the selected comparator output level:
  *         @arg COMP_OUTPUT_LEVEL_LOW
  *         @arg COMP_OUTPUT_LEVEL_HIGH
  *
  */
uint32_t HAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameter */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return (uint32_t)(READ_BIT(hcomp->Instance->CSR, COMP_CSR_COMP_OUT)
                    >> COMP_OUTPUT_LEVEL_BITOFFSET_POS);
}

/**
  * @brief  Comparator trigger callback.
  * @param  hcomp  COMP handle
  * @retval None
  */
__weak void HAL_COMP_TriggerCallback(COMP_HandleTypeDef *hcomp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcomp);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_COMP_TriggerCallback should be implemented in the user file
   */
}


/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions.
  *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Return the COMP handle state.
  * @param  hcomp  COMP handle
  * @retval HAL state
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp)
{
  /* Check the COMP handle allocation */
  if(hcomp == NULL)
  {
    return HAL_COMP_STATE_RESET;
  }

  /* Check the parameter */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  /* Return HAL COMP handle state */
  return hcomp->State;
}

/**
  * @brief  Return the COMP error code.
  * @param hcomp COMP handle
  * @retval COMP error code
  */
uint32_t HAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameters */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return hcomp->ErrorCode;
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup COMP_Private_Functions
  * @{
  */

/**
  * @brief  Configure the Vrefint or Vrefbuf or Vrefcmp 
  * @param  hcomp  COMP handle
  * @retval None
  */
static HAL_StatusTypeDef COMP_VrefConfig(COMP_HandleTypeDef *hcomp)
{ 
  HAL_StatusTypeDef status = HAL_OK;
  if((hcomp->Init.InputMinus == COMP_INPUT_MINUS_VREFINT) || (hcomp->Init.InputMinus == COMP_INPUT_MINUS_TS_VIN))
  {
    FlagStatus adcclkchanged = RESET;
    
    if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
    {
      __HAL_RCC_ADC_CLK_ENABLE();
      adcclkchanged = SET;
    }
      
    if(hcomp->Init.InputMinus == COMP_INPUT_MINUS_VREFINT)
    {
      SET_BIT(ADC_COMMON->CCR, (ADC_CCR_VREFINT_EN));
    }
    else
    {
      SET_BIT(ADC_COMMON->CCR, (ADC_CCR_TSEN));
    }
      
    /* Restore clock configuration if changed */
    if (adcclkchanged == SET)
    {
      __HAL_RCC_ADC_CLK_DISABLE();
    }
  }  
#if defined(VREFBUF)    
  else if(hcomp->Init.InputMinus == COMP_INPUT_MINUS_VREFBUF)
  {
    /*Configure VREFBUF level */
    if(hcomp->Init.VrefSrc != COMP_VREF_SOURCE_VCC)
    {
      MODIFY_REG(VREFBUF->CR, (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL), hcomp->Init.VrefSrc);
    }
    else
    {
      status = HAL_ERROR;
    }

  } 
#endif         
  else if(hcomp->Init.InputMinus == COMP_INPUT_MINUS_VREFCMP)
  {
    /* Voltage divider */       
    FlagStatus comp1clkchanged = RESET;
    
    if (__HAL_RCC_COMP1_IS_CLK_DISABLED() != 0U)
    {
      __HAL_RCC_COMP1_CLK_ENABLE();
      comp1clkchanged = SET;
    }

    /* Enable VREFCMP */  
    SET_BIT(COMP12_COMMON->CCSR, COMP_CCSR_VREFCMP_EN);

    if(hcomp->Init.VrefSrc == COMP_VREF_SOURCE_VCC)
    {
      /* VREFCMP Sourece Select VCC */
      SET_BIT(COMP12_COMMON->CCSR, COMP_CCSR_SSEL);
    }
#if defined(VREFBUF)
    else
    {  
      /* Configure VREFBUF Level */ 
      CLEAR_BIT(COMP12_COMMON->CCSR, COMP_CCSR_SSEL);
      MODIFY_REG(VREFBUF->CR, (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL), hcomp->Init.VrefSrc);
    }   
#endif    
    /* Set Reference Divider */
    MODIFY_REG(COMP12_COMMON->CCSR, COMP_CCSR_VCDIV, hcomp->Init.VrefDiv);    
       
    /* Restore clock configuration if changed */
    if (comp1clkchanged == SET)
    {
      __HAL_RCC_COMP1_CLK_DISABLE();
    }
  }
  else
  {
  }
  
  return status;
}  

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
